[
    {
      "githubId": 4,
      "title": "Introduction to Mathematics",
      "body": "Mathematics is the study of numbers, quantities, and shapes. It plays a fundamental role in science, technology, and everyday life. From basic arithmetic to advanced calculus, math is a universal language that helps us understand the world around us. Whether you're calculating the distance between planets or managing your personal finances, math is a vital tool.",
      "likes": {
        "2": true,
        "7": true,
        "5": true,
        "1": true,
        "9": true,
        "3": true
      },
      "pending": false
    },
    {
      "githubId": 8,
      "title": "Learn a New Language",
      "body": "Learning a new language can open up new opportunities for communication and understanding other cultures. Whether you're interested in becoming multilingual for personal growth or need a new language for work or travel, the process of language acquisition is both rewarding and fascinating.",
      "likes": {
        "6": true,
        "8": true,
        "4": true,
        "3": true,
        "1": true,
        "9": true
      },
      "pending": true
    },
    {
      "githubId": 3,
      "title": "History of Ancient Civilizations",
      "body": "Explore the rich history of ancient civilizations like Egypt, Mesopotamia, and the Indus Valley. These ancient cultures left a profound impact on the development of human society. Studying their history and achievements can provide valuable insights into the origins of modern civilization.",
      "likes": {
        "10": true,
        "2": true,
        "4": true,
        "7": true,
        "5": true,
        "1": true
      },
      "pending": false
    },
    {
      "githubId": 2,
      "title": "Introduction to Programming",
      "body": "Programming is a valuable skill in the digital age. Start with the basics of coding and problem-solving. Whether you're interested in building websites, mobile apps, or creating software, programming is the key to turning your ideas into reality.",
      "likes": {
        "6": true,
        "9": true,
        "8": true,
        "3": true,
        "2": true,
        "10": true
      },
      "pending": false
    },
    {
      "githubId": 1,
      "title": "Understanding Physics",
      "body": "Physics is the study of matter, energy, and the fundamental forces of the universe. Dive into the world of physics and discover the underlying principles that govern our world. Whether you're curious about the behavior of atoms or the motion of planets, physics provides answers to fundamental questions.",
      "likes": {
        "8": true,
        "5": true,
        "2": true,
        "7": true,
        "4": true,
        "1": true
      },
      "pending": true
    },
    {
      "githubId": 4,
      "title": "Art History",
      "body": "Explore the rich world of art history and discover the masterpieces created by renowned artists throughout history. From the captivating works of the Renaissance to the groundbreaking innovations of modern art, art history offers insights into the evolution of human expression.",
      "likes": {
        "3": true,
        "6": true,
        "9": true,
        "2": true,
        "7": true,
        "4": true
      },
      "pending": false
    },
    {
      "githubId": 7,
      "title": "Chemistry Essentials",
      "body": "Chemistry is the science of matter and its properties. Dive into the world of chemical reactions, elements, and the periodic table. Whether you're interested in the composition of compounds or the intricacies of chemical bonding, chemistry is the key to understanding the world on a molecular level.",
      "likes": {
        "5": true,
        "8": true,
        "1": true,
        "10": true,
        "2": true,
        "6": true
      },
      "pending": false
    },
    {
      "githubId": 9,
      "title": "Environmental Conservation",
      "body": "Environmental conservation is the practice of protecting our planet's ecosystems and biodiversity. Learn about sustainable practices, conservation efforts, and the importance of preserving natural resources for future generations.",
      "likes": {
        "4": true,
        "7": true,
        "3": true,
        "9": true,
        "5": true,
        "1": true
      },
      "pending": false
    },
    {
      "githubId": 6,
      "title": "Astronomy Wonders",
      "body": "Astronomy is the study of the cosmos, from distant galaxies to our own solar system. Explore the mysteries of the universe, from the birth and death of stars to the search for extraterrestrial life.",
      "likes": {
        "2": true,
        "8": true,
        "6": true,
        "10": true,
        "1": true,
        "7": true
      },
      "pending": false
    },
    {
      "githubId": 1,
      "title": "Philosophy of Ethics",
      "body": "Philosophy of ethics delves into the fundamental questions of right and wrong. Explore ethical theories, moral dilemmas, and the foundations of ethical decision-making. Dive into the world of ethics and engage in thought-provoking discussions.",
      "likes": {
        "9": true,
        "5": true,
        "3": true,
        "6": true,
        "4": true,
        "8": true
      },
      "pending": false
    },
    {
      "githubId": 2,
      "title": "The World of Music",
      "body": "Music is a universal language that transcends borders and connects people. Explore the history of music, from classical compositions to contemporary genres. Dive into the world of melodies, harmonies, and the cultural significance of music.",
      "likes": {
        "4": true,
        "10": true,
        "2": true,
        "7": true,
        "6": true,
        "1": true
      },
      "pending": false
    },
    {
      "githubId": 5,
      "title": "Geology Unveiled",
      "body": "Geology is the study of Earth's structure and processes. Delve into the world of rocks, minerals, and the forces that shape our planet. Explore geological wonders, from volcanoes to the formation of mountains.",
      "likes": {
        "5": true,
        "3": true,
        "9": true,
        "8": true,
        "7": true,
        "2": true
      },
      "pending": false
    },
    {
      "githubId": 9,
      "title": "Culinary Arts Mastery",
      "body": "Culinary arts are the art of cooking and presentation. Explore the world of flavors, cooking techniques, and the culture of cuisine. From mastering the perfect soufflé to savoring international dishes, culinary arts offer a delicious journey.",
      "likes": {
        "1": true,
        "6": true,
        "4": true,
        "10": true,
        "3": true,
        "8": true
      },
      "pending": false
    },
    {
      "githubId": 7,
      "title": "Political Science Insights",
      "body": "Political science examines the systems and dynamics of governance. Dive into the world of politics, from the intricacies of international relations to the inner workings of governments. Explore the impact of policy and decision-making on society.",
      "likes": {
        "9": true,
        "2": true,
        "7": true,
        "5": true,
        "1": true,
        "4": true
      },
      "pending": false
    },
    {
      "githubId": 5,
      "title": "Digital Marketing Strategies",
      "body": "Digital marketing is a dynamic field that encompasses various online strategies to promote businesses and engage with customers. Learn about search engine optimization (SEO), social media marketing, email marketing, and more. Explore the latest trends and tools in digital marketing to boost your online presence.",
      "likes": {
        "8": true,
        "5": true,
        "3": true,
        "6": true,
        "4": true,
        "1": true
      },
      "pending": true
    }
  ]